[
  {
    "id": 1,
    "estate_title": "Skyline Penthouse Retreat",
    "segment_name": "Penthouse",
    "description": "Magnificent penthouse offering unparalleled views of the city skyline, featuring exquisite design and luxurious amenities. This stunning penthouse boasts floor-to-ceiling windows, allowing natural light to flood the space and providing breathtaking vistas of the bustling city below. With sleek modern interiors, high-end finishes, and state-of-the-art home automation system, this urban oasis offers the epitome of contemporary luxury living. Indulge in the ultimate penthouse experience with access to exclusive amenities, including an infinity pool, sky lounge, and fitness center.",
    "price": "$ 7,500,000",
    "status": "sale",
    "area": "4,200 sq ft",
    "location": "New York City, New York",
    "facilities": ["Infinity pool", "Sky lounge", "Home automation system"],
    "image": "https://images.pexels.com/photos/5997993/pexels-photo-5997993.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 2,
    "estate_title": "Seaside Mansion",
    "segment_name": "Mansion",
    "description": "Elegant mansion nestled on the coast, boasting grandeur and sophistication with expansive living spaces and manicured gardens. This exquisite mansion offers the ultimate in coastal living, with sweeping ocean views and direct access to pristine sandy beaches. The grand foyer welcomes you with its soaring ceilings and elegant staircase, leading to the spacious living areas adorned with luxurious furnishings and fine finishes. Enjoy outdoor entertaining in the beautifully landscaped gardens, complete with a private pool, tennis court, and alfresco dining area. With its unparalleled beauty and timeless elegance, this seaside mansion is the epitome of luxury living.",
    "price": "$ 12,000,000",
    "status": "rent",
    "area": "8,500 sq ft",
    "location": "Los Angeles, California",
    "facilities": ["Private beach access", "Tennis court", "Wine cellar"],
    "image": "https://images.pexels.com/photos/877994/pexels-photo-877994.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 3,
    "estate_title": "Exclusive Beachfront Resort",
    "segment_name": "Resort",
    "description": "An exclusive beachfront resort offering luxury accommodations, fine dining, and a range of recreational activities. Nestled along the pristine shores of St. Tropez, this exclusive resort beckons with its unparalleled beauty and world-class amenities. Experience the ultimate in relaxation and indulgence in one of the resort's private villas, each elegantly appointed and featuring breathtaking ocean views. Indulge your senses with gourmet cuisine at the resort's fine dining restaurants, or pamper yourself with a rejuvenating treatment at the spa and wellness center. Whether you're seeking adventure or relaxation, this beachfront resort offers the perfect escape for discerning travelers.",
    "price": "$ 30,000,000",
    "status": "sale",
    "area": "30 acres",
    "location": "St. Tropez, France",
    "facilities": ["Private villas", "Spa & wellness center", "Gourmet restaurants"],
    "image": "https://images.pexels.com/photos/5007356/pexels-photo-5007356.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 4,
    "estate_title": "Private Island Oasis",
    "segment_name": "Private Island",
    "description": "Escape to your own private island retreat, surrounded by turquoise waters and pristine beaches, offering unparalleled tranquility and luxury. This secluded island paradise is a haven for those seeking privacy and serenity, with acres of lush tropical landscapes and secluded coves to explore. The main residence features luxurious accommodations, elegantly appointed with modern furnishings and stunning ocean views. Enjoy outdoor living at its finest with expansive terraces, infinity pools, and alfresco dining areas overlooking the sparkling waters. With its unparalleled beauty and seclusion, this private island oasis offers the ultimate escape from the ordinary.",
    "price": "$ 40,000,000",
    "status": "sale",
    "area": "100 acres",
    "location": "Fiji",
    "facilities": ["Luxury residences", "Helipad", "Marina"],
    "image": "https://images.pexels.com/photos/1450340/pexels-photo-1450340.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 5,
    "estate_title": "Luxury Ski Chalet",
    "segment_name": "Chalet",
    "description": "Exquisite ski chalet nestled in the mountains, offering ski-in/ski-out access and indulgent amenities for the ultimate alpine getaway. This luxurious chalet is the perfect retreat for avid skiers and outdoor enthusiasts, with direct access to the slopes and stunning mountain views. The interior is elegantly appointed with rustic-chic decor, featuring cozy fireplaces, timber beams, and plush furnishings. After a day on the slopes, unwind in the private sauna or enjoy a movie in the home theater. With its prime location and luxurious amenities, this ski chalet offers the ultimate alpine escape.",
    "price": "$ 6,500,000",
    "status": "sale",
    "area": "6,000 sq ft",
    "location": "Aspen, Colorado",
    "facilities": ["Sauna", "Home theater", "Ski room"],
    "image": "https://images.pexels.com/photos/20400796/pexels-photo-20400796/free-photo-of-luca-s-first-hike-was-a-loop-around-emerald-lake-in-yoho-national-park.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 6,
    "estate_title": "Oceanfront Villa Retreat",
    "segment_name": "Villa",
    "description": "A luxurious oceanfront villa retreat offering unparalleled privacy and stunning ocean views, ideal for relaxation and entertainment. This exquisite villa is situated on the shores of Cabo San Lucas, boasting panoramic views of the azure waters and golden sands. The spacious interior is elegantly appointed with luxurious furnishings and modern amenities, providing the perfect blend of comfort and sophistication. Step outside to the expansive terrace, where you can relax by the infinity pool, dine al fresco, or simply soak in the breathtaking views. With its idyllic location and luxurious amenities, this oceanfront villa offers the ultimate retreat for discerning travelers.",
    "price": "$ 9,500,000",
    "status": "rent",
    "area": "7,200 sq ft",
    "location": "Cabo San Lucas, Mexico",
    "facilities": ["Infinity pool", "Private beach", "Outdoor kitchen"],
    "image": "https://images.pexels.com/photos/1438834/pexels-photo-1438834.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 7,
    "estate_title": "Exotic Island Resort",
    "segment_name": "Resort",
    "description": "Escape to an exotic island resort surrounded by lush tropical landscapes, offering luxurious accommodations and world-class amenities. Nestled in the pristine waters of the Seychelles, this exotic island resort is a sanctuary of luxury and tranquility. Indulge in the ultimate island getaway with luxurious overwater bungalows, private yacht charters, and a world-class diving center. Explore the island's natural beauty with guided nature walks, or simply relax on the white-sand beaches and soak up the sun. With its breathtaking scenery and unparalleled hospitality, this exotic island resort offers a truly unforgettable experience.",
    "price": "$ 25,000,000",
    "status": "sale",
    "area": "50 acres",
    "location": "Seychelles",
    "facilities": ["Overwater bungalows", "Private yacht charters", "Diving center"],
    "image": "https://images.pexels.com/photos/1450360/pexels-photo-1450360.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 8,
    "estate_title": "Luxury Lakefront Estate",
    "segment_name": "Estate",
    "description": "Stunning lakefront estate offering panoramic views and unparalleled luxury, featuring expansive grounds and modern amenities. Located on the shores of Lake Como, this stunning estate offers the ultimate in lakeside living, with breathtaking views of the sparkling waters and surrounding mountains. The grand main residence is elegantly appointed with luxurious furnishings and high-end finishes, creating a sense of refined elegance throughout. Step outside to the expansive grounds, where you'll find lush gardens, a swimming pool, and a private boat dock. With its unparalleled beauty and world-class amenities, this lakefront estate offers a lifestyle of luxury and sophistication.",
    "price": "$ 15,800,000",
    "status": "sale",
    "area": "10,000 sq ft",
    "location": "Lake Como, Italy",
    "facilities": ["Boat dock", "Swimming pool", "Wine cellar"],
    "image": "https://images.pexels.com/photos/4237154/pexels-photo-4237154.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 9,
    "estate_title": "Tropical Beachfront Retreat",
    "segment_name": "Villa",
    "description": "Escape to a tropical paradise in this beachfront villa retreat, featuring luxurious accommodations and breathtaking ocean views. Located on the shores of Phuket, Thailand, this stunning villa offers the perfect blend of luxury and serenity, with direct access to a pristine sandy beach and panoramic views of the turquoise waters. The villa's interior is elegantly appointed with modern furnishings and Thai-inspired decor, creating a sense of tropical luxury throughout. Step outside to the private infinity pool, where you can relax in the sun or take a refreshing dip in the crystal-clear waters. With its idyllic location and luxurious amenities, this tropical beachfront retreat offers the ultimate escape from the everyday.",
    "price": "$ 7,200 per night",
    "status": "rent",
    "area": "5,500 sq ft",
    "location": "Phuket, Thailand",
    "facilities": ["Private infinity pool", "Personal chef", "Beachfront terrace"],
    "image": "https://images.pexels.com/photos/2476632/pexels-photo-2476632.jpeg?auto=compress&cs=tinysrgb&w=600"
  }
]
